export default {
  about: {
    title: "เกี่ยวกับฉัน",
    name: "ศศิธร เตชะวรรณพงษ์ (เฟิร์น)",
    dob: "14 สิงหาคม 2541",
    educationTitle: "ประวัติการศึกษา (สิงหาคม 2560 - มิถุนายน 2564)",
    educationDesc1: "ปริญญาตรี สาขาวิทยาการคอมพิวเตอร์",
    educationDesc2: "มหาวิทยาลัยขอนแก่น",
    devTitle: "การพัฒนาด้านวิชาชีพ (ธ.ค. 2567 - พ.ค. 2568)",
    devDesc1: "ภาษาอังกฤษเพื่อการสื่อสาร (ระดับกลาง)",
    devDesc2: "ICL Graduate Business School",
    softSkillTitle: "ทักษะด้านบุคลิกภาพ",
    softSkillList: [
      "การแก้ไขปัญหาและวิเคราะห์อย่างมีระบบ",
      "สามารถทำงานร่วมกับผู้อื่นและปรับตัวได้ดี",
      "มีทักษะการสื่อสารและการฟังอย่างตั้งใจ",
    ],
  },
};
